index-builder/src/test/java/test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:zes="http://zesing.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <zes:SaveBookingRegister>
            <zes:OrgnaizationId>0008</zes:OrgnaizationId>
            <zes:HisPatId>2320362</zes:HisPatId>
            <zes:Name>微信测试</zes:Name>
            <zes:Sex>1</zes:Sex>
            <zes:Birthday>1991-07-25</zes:Birthday>
            <zes:IdentityNo>350525199107250591</zes:IdentityNo>
            <zes:identityKindId>1</zes:identityKindId>
            <zes:CardNo>20115755</zes:CardNo>
            <zes:CardKindId>1</zes:CardKindId>
            <zes:MobilePhone>15913172331</zes:MobilePhone>
            <zes:RegDate>2016-11-03</zes:RegDate>
            <zes:RegId>1898(582)</zes:RegId>
            <zes:DoctorId>1898</zes:DoctorId>
            <zes:RegName>内分泌代谢科门诊</zes:RegName>
            <zes:TimeSlotId>1</zes:TimeSlotId>
            <zes:StartTime>14:30</zes:StartTime>
            <zes:EndTime>16:00</zes:EndTime>
        </zes:SaveBookingRegister>
    </soapenv:Body>
</soapenv:Envelope>